# JS转换
TRADE_TYPE = {
    "10000000": "进出口收发货人",
    "01000000": "报关企业",
    "00100000": "报关企业分支机构",
    "00010000": "特殊监管区双重身份企业",
    "00000100": "临时注册企业",
    "00000010": "加工生产企业",
    "00000001": "保税仓库",
    "000000001": "进出境运输工具负责人",
    "00000002": "出口监管仓库",
    "20000000": "进出口收发货人分支机构",
}

APANAGE= {
    "01": "经济特区",
    "02":  "经济技术开发全区",
    "03": "高新技术产业开发区",
    "04": "保税区",
    "05":  "出口加工区",
    "06": "保税港区、综合保税区",
    "07": "保税物流园区",
    "09": "一般经济区域",
}

REVOKE = {
    "0": "正常",
    "1": "注销",
}

ANN_REPORT = {
    "0": "已经报过年报",
    "1":"未报送",
}

TYPE = {
    "AA": "高级认证企业",
    "0": "高级认证企业",
    "A": "一般认证企业",
    "1": "一般认证企业",
    "B":  "一般信用企业",
    "C": "失信企业",
    "D": "失信企业",
}

SPECIAL_TRADE_ZONE = {
    "3122F941": "外高桥保税区",
    "3122F972": "外高桥保税物流园区",
    "3116F963": "洋山保税港区",
    "3122F964": "浦东机场综合保税区",
    "3122F295":  "陆家嘴金融片区",
    "3122F296": "上海金桥开发区",
    "3122F297": "张江高科技片区",
    "1207F991": "天津港非特殊监管区",
    "1207F961": "东疆保税港区",
    "1210F992": "天津机场非特殊监管区",
    "1207F942": "天津机场保税区空港",
    "1210F962": "天津机场滨海新区综合保税区",
    "1207F993": "滨海商务区非特殊监管区",
    "1207F943": "滨海商务区保税区海港",
    "1207F973": "滨海商务区保税物流园",
    "3512F991": "平潭非综合区",
    "3512F981": "平潭综合实验区",
    "3501F293": "福州经开区非特殊监管区",
    "3501F243": "福州保税区",
    "3501F253": "福州出口加工区",
    "3501F963": "福州保税港区",
    "3502F992": "厦门非特殊监管区",
    "3502F942": "厦门象屿保税区",
    "3502F972": "象屿保税物流园区",
    "3502F962": "厦门海沧保税港区",
    "4403F992": "蛇口非特殊监管区",
    "4403F962": "蛇口前海保税港区",
    "4430F991": "南沙新区非特殊监管区",
    "4430F961": "广州南沙保税港区",
    "4404F993": "珠海横琴新区",
    "99999999": "非特殊区域",
}


REGISTER_INFOS = {
    'social_credit_code': '统一社会信用代码',
    'customs_code': '海关注册编码',
    'register_date': '注册日期',
    'org_code': '组织机构代码',
    'enterprise_name': '企业中文名称',
    'registered_customs': '注册海关',
    'address': '工商注册地址',
    'admin_area': '行政区划',
    'economics_area': '经济区划',
    'category': '经营类别',
    'special_area': '特殊贸易区域',
    'industry': '行业种类',
    'validity_period': '报关有效期',
    'types_trade': '跨境贸易电子商务类型',
    'customs_flag': '海关注销标志',
    'report': '年报情况',
}

# 主库配置
HOST = '192.168.100.81'
PORT = 3306
DATABASE = 'customs_data'
USER = 'yuancheng'
PASSWORD = 'mysql'
CHARSET = 'utf8'
# jsf数据库-从库配置
JSF_HOST = '192.168.100.30'
JSF_PORT = 3306
JSF_DATABASE = 'announcement'
JSF_USER = 'user_jsf'
JSF_PASSWORD = 'Jsf1122!'
JSF_CHARSET = 'utf8'